apache/nuttx/arch/arm/src/tiva/chip/tm4c_vectors.h
VECTOR(tiva_ssi2, TIVA_IRQ_SSI2)             /* Vector 70: SSI 2 */
VECTOR(tiva_ssi3, TIVA_IRQ_SSI3)             /* Vector 71: SSI 3 */
VECTOR(tiva_uart3, TIVA_IRQ_UART3)           /* Vector 72: UART 3 */
VECTOR(tiva_uart4, TIVA_IRQ_UART4)           /* Vector 73: UART 4 */
VECTOR(tiva_uart5, TIVA_IRQ_UART5)           /* Vector 74: UART 5 */
VECTOR(tiva_uart6, TIVA_IRQ_UART6)           /* Vector 75: UART 6 */
VECTOR(tiva_uart7, TIVA_IRQ_UART7)           /* Vector 76: UART 7 */
VECTOR(tiva_i2c2, TIVA_IRQ_I2C2)             /* Vector 77: I2C 2 */
VECTOR(tiva_i2c3, TIVA_IRQ_I2C3)             /* Vector 78: I2C 3 */
VECTOR(tiva_timer4a, TIVA_IRQ_TIMER4A)       /* Vector 79: 16/32-Bit Timer 4 A */

VECTOR(tiva_timer4b, TIVA_IRQ_TIMER4B)       /* Vector 80: 16/32-Bit Timer 4 B */
VECTOR(tiva_timer5a, TIVA_IRQ_TIMER5A)       /* Vector 81: 16/32-Bit Timer 5 A */
VECTOR(tiva_timer5b, TIVA_IRQ_TIMER5B)       /* Vector 82: 16/32-Bit Timer 5 B */
VECTOR(tiva_float, TIVA_IRQ_FLOAT)           /* Vector 83: Floating point exception */
UNUSED(TIVA_RESERVED_84)                     /* Vector 84: Reserved */
UNUSED(TIVA_RESERVED_85)                     /* Vector 85: Reserved */
VECTOR(tiva_i2c4, TIVA_IRQ_I2C4)             /* Vector 86: I2C 2 */
VECTOR(tiva_i2c5, TIVA_IRQ_I2C5)             /* Vector 87: I2C 3 */
VECTOR(tiva_gpiom, TIVA_IRQ_GPIOM)           /* Vector 88: GPIO Port M */
VECTOR(tiva_gpion, TIVA_IRQ_GPION)           /* Vector 89: GPIO Port N */

UNUSED(TIVA_RESERVED_90)                     /* Vector 90: Reserved */
VECTOR(tiva_tamper, TIVA_IRQ_TAMPER)         /* Vector 91: Tamper */
VECTOR(tiva_gpiop, TIVA_IRQ_GPIOP)           /* Vector 92: GPIO Port P (Summary or P0) */
VECTOR(tiva_gpiop1, TIVA_IRQ_GPIOP1)         /* Vector 93: GPIO Port P1 */
VECTOR(tiva_gpiop2, TIVA_IRQ_GPIOP2)         /* Vector 94: GPIO Port P2 */
VECTOR(tiva_gpiop3, TIVA_IRQ_GPIOP3)         /* Vector 95: GPIO Port P3 */
VECTOR(tiva_gpiop4, TIVA_IRQ_GPIOP4)         /* Vector 96: GPIO Port P4 */
VECTOR(tiva_gpiop5, TIVA_IRQ_GPIOP5)         /* Vector 97: GPIO Port P5 */
VECTOR(tiva_gpiop6, TIVA_IRQ_GPIOP6)         /* Vector 98: GPIO Port P6 */
VECTOR(tiva_gpiop7, TIVA_IRQ_GPIOP7)         /* Vector 99: GPIO Port P7 */

VECTOR(tiva_gpioq, TIVA_IRQ_GPIOQ)           /* Vector 100: GPIO Port Q (Summary or Q0) */
VECTOR(tiva_gpioq1, TIVA_IRQ_GPIOQ1)         /* Vector 101: GPIO Port Q1 */
VECTOR(tiva_gpioq2, TIVA_IRQ_GPIOQ2)         /* Vector 102: GPIO Port Q2 */
VECTOR(tiva_gpioq3, TIVA_IRQ_GPIOQ3)         /* Vector 103: GPIO Port Q3 */
VECTOR(tiva_gpioq4, TIVA_IRQ_GPIOQ4)         /* Vector 104: GPIO Port Q4 */
VECTOR(tiva_gpioq5, TIVA_IRQ_GPIOQ5)         /* Vector 105: GPIO Port Q5 */
VECTOR(tiva_gpioq6, TIVA_IRQ_GPIOQ6)         /* Vector 106: GPIO Port Q6 */
VECTOR(tiva_gpioq7, TIVA_IRQ_GPIOQ7)         /* Vector 107: GPIO Port Q7 */
UNUSED(TIVA_RESERVED_108)                    /* Vector 108: Reserved */
UNUSED(TIVA_RESERVED_109)                    /* Vector 109: Reserved */

UNUSED(TIVA_RESERVED_110)                    /* Vector 110: Reserved */
UNUSED(TIVA_RESERVED_111)                    /* Vector 111: Reserved */
UNUSED(TIVA_RESERVED_112)                    /* Vector 112: Reserved */
UNUSED(TIVA_RESERVED_113)                    /* Vector 113: Reserved */
VECTOR(tiva_timer6a, TIVA_IRQ_TIMER6A)       /* Vector 114: 16/32-Bit Timer 6 A */
VECTOR(tiva_timer6b, TIVA_IRQ_TIMER6B)       /* Vector 115: 16/32-Bit Timer 6 B */
VECTOR(tiva_timer7a, TIVA_IRQ_TIMER7A)       /* Vector 116: 16/32-Bit Timer 7 A */
VECTOR(tiva_timer7b, TIVA_IRQ_TIMER7B)       /* Vector 117: 16/32-Bit Timer 7 B */
VECTOR(tiva_i2c6, TIVA_IRQ_I2C6)             /* Vector 118: I2C 6 */
VECTOR(tiva_i2c7, TIVA_IRQ_I2C7)             /* Vector 119: I2C 7 */

UNUSED(TIVA_RESERVED_120)                    /* Vector 120: Reserved */
UNUSED(TIVA_RESERVED_121)                    /* Vector 121: Reserved */
UNUSED(TIVA_RESERVED_122)                    /* Vector 122: Reserved */
UNUSED(TIVA_RESERVED_123)                    /* Vector 123: Reserved */
UNUSED(TIVA_RESERVED_124)                    /* Vector 124: Reserved */
VECTOR(tiva_i2c8, TIVA_IRQ_I2C8)             /* Vector 125: I2C 8 */
VECTOR(tiva_i2c9, TIVA_IRQ_I2C9)             /* Vector 126: I2C 9 */
UNUSED(TIVA_RESERVED_127)                    /* Vector 127: Reserved */
UNUSED(TIVA_RESERVED_128)                    /* Vector 128: Reserved */
UNUSED(TIVA_RESERVED_129)                    /* Vector 129: Reserved */

# endif /* CONFIG_ARMV7M_CMNVECTOR */
#else
#  error "Vectors not known for this Tiva chip"
#endif
